MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
/**
 * @file      wwvb_clock.ino
 * @brief     ESP32-S3 WWVB Atomic Clock with ES100 Receiver
 * @author    Generated for LilyGo T-Display-S3 AMOLED
 * @date      2025
 * 
 * Hardware Configuration:
 * - LilyGo T-Display-S3 AMOLED (1.91 inch, 240x536)
 * - ES100 WWVB Receiver Module
 * 
 * Display Library: LilyGo-AMOLED-Series with TFT_eSPI Sprite
 * 
 * ES100 Connections:
 * - SDA: GPIO3 (STEMMA QT connector)
 * - SCL: GPIO2 (STEMMA QT connector)
 * - EN:  GPIO1 (ES100 enable/power control)
 * - IRQ: GPIO4 (ES100 interrupt, active low)
 */

#include <Arduino.h>
#include <Wire.h>
#include <TFT_eSPI.h>
#include <Preferences.h>
#include <RTClib.h>
#include <esp_sleep.h>
#include <esp_task_wdt.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include "LilyGo_AMOLED.h"
#include "ES100.h"
#include "TimeManager.h"
#include "ReceptionHistory.h"
#include "NTPServer.h"
#include "CaptivePortal.h"
#include "StatusServer.h"
#include "config.h"

// ============================================================================
// Pin Definitions for LilyGo T-Display-S3 AMOLED
// ============================================================================
#define I2C_SDA_PIN         3       // Wire bus 0: touch, PMU, DS3231
#define I2C_SCL_PIN         2
#define ES100_SDA_PIN       15      // Wire1 bus 1: ES100 (isolated)
#define ES100_SCL_PIN       16
#define ES100_EN_PIN        40
#define ES100_IRQ_PIN       41

// ============================================================================
// Display Objects - LilyGo AMOLED + TFT_eSPI Sprite
// ============================================================================
LilyGo_Class amoled;
TFT_eSPI tft = TFT_eSPI();
TFT_eSprite sprite = TFT_eSprite(&tft);

// Display dimensions (will be set after initialization)
uint16_t DISPLAY_WIDTH;
uint16_t DISPLAY_HEIGHT;

// ============================================================================
// Global Objects
// ============================================================================
ES100 es100(ES100_EN_PIN, ES100_IRQ_PIN);
RTC_DS3231 rtc;
TimeManager timeManager;
ReceptionHistory receptionHistory;
Preferences preferences;

// ============================================================================
// State Variables
// ============================================================================
volatile bool es100InterruptFlag = false;
bool es100Receiving = false;
bool es100Available = false;
bool es100TrackingReady = false;        // True after a successful normal-mode decode
bool es100UsingTracking = false;        // True if current attempt is tracking mode
unsigned long es100TrackingReadySinceMs = 0; // millis() when es100TrackingReady was last set
unsigned long lastDisplayUpdate = 0;
unsigned long lastSyncAttempt = 0;
uint8_t daytimeFailures = 0;          // Consecutive daytime sync failures
bool daytimeSkipActive = false;       // True when backed off until nighttime
int8_t utcOffset = -5;  // Eastern Time
bool dstActive = false;
unsigned long lastDSTCheck = 0;  // millis() of last auto-DST computation

// ES100 initialization retry tracking
uint8_t es100InitRetries = 0;
unsigned long lastES100InitAttempt = 0;
const uint8_t MAX_ES100_INIT_RETRIES = 5;
const unsigned long ES100_RETRY_INTERVALS[] = {5000, 10000, 30000, 60000, 300000};  // 5s, 10s, 30s, 1m, 5m

// DS3231 RTC tracking
bool rtcAvailable = false;
float rtcTemperature = 0.0;  // Temperature from DS3231 (Celsius)
unsigned long lastTempRead = 0;  // millis() of last temperature read

// Low battery tracking
bool lowBatteryAlerted = false;         // True once 10% alert has been triggered
unsigned long lastLowBattWarn = 0;      // millis() of last serial warning
uint8_t critBattCount = 0;              // Consecutive critical-battery readings (debounce)

// Time source tracking
enum TimeSource { TIME_SRC_NONE, TIME_SRC_RTC, TIME_SRC_NTP, TIME_SRC_WWVB };
TimeSource lastTimeSource = TIME_SRC_NONE;
unsigned long lastTimeSyncMillis = 0;  // millis() when last synced

// Display regions (will be calculated based on display height)
uint16_t CLOCK_Y;
uint16_t DATE_Y;
uint16_t STATUS_Y;
uint16_t CHART_Y;
uint16_t CHART_HEIGHT;

// ============================================================================
// Page Navigation & Touch State
// ============================================================================
enum DisplayPage { PAGE_CLOCK, PAGE_UTC, PAGE_SETTINGS, PAGE_WIFI };
DisplayPage currentPage = PAGE_CLOCK;
uint8_t currentBrightness = DISPLAY_BRIGHTNESS;

// Touch tracking
int16_t touchStartX = 0, touchStartY = 0;
int16_t touchLastX = 0, touchLastY = 0;
unsigned long touchStartTime = 0;
bool touchActive = false;
bool swipeHandled = false;
bool sliderDragging = false;

// Shutdown long-press tracking
bool shutdownCountdownActive = false;

// Slider geometry (set in initDisplay based on screen size)
int16_t sliderX = 40;
int16_t sliderWidth = 456;
int16_t sliderY = 100;
int16_t sliderHeight = 30;
int16_t sliderTouchPadding = 20;  // Extra touch area above/below slider

// ============================================================================
// WiFi State
// ============================================================================
enum WiFiState {
    WIFI_STATE_OFF,
    WIFI_STATE_SCANNING,
    WIFI_STATE_IDLE,
    WIFI_STATE_CONNECTING,
    WIFI_STATE_CONNECTED,
    WIFI_STATE_AP_MODE
};

WiFiState wifiState = WIFI_STATE_OFF;
String wifiSSID, wifiPassword;
String scannedSSIDs[WIFI_MAX_NETWORKS];
int8_t scannedRSSI[WIFI_MAX_NETWORKS];
bool scannedSecure[WIFI_MAX_NETWORKS];
uint8_t scannedCount = 0;
int8_t selectedNetwork = -1;
int8_t listScrollOffset = 0;
unsigned long wifiConnectStart = 0;
unsigned long lastWifiScan = 0;
String wifiErrorMsg = "";

NTPServer ntpServer;
CaptivePortal captivePortal;
StatusServer statusServer;
StatusData statusData;
bool portalCredsReceived = false;  // Flag: credentials arrived from captive portal, handle in loop

// ============================================================================
// On-Screen Keyboard State
// ============================================================================
enum KeyboardMode { KB_HIDDEN, KB_LOWER, KB_UPPER, KB_SYMBOLS };
KeyboardMode kbMode = KB_HIDDEN;
char passwordBuffer[KB_PASSWORD_MAX + 1] = {0};
uint8_t passwordLen = 0;
bool passwordVisible = false;

// Keyboard layout arrays
static const char KB_ROW1_LOWER[] = "qwertyuiop";
static const char KB_ROW2_LOWER[] = "asdfghjkl";
static const char KB_ROW3_LOWER[] = "zxcvbnm";
static const char KB_ROW1_UPPER[] = "QWERTYUIOP";
static const char KB_ROW2_UPPER[] = "ASDFGHJKL";
static const char KB_ROW3_UPPER[] = "ZXCVBNM";
static const char KB_ROW1_SYM[]   = "1234567890";
static const char KB_ROW2_SYM[]   = "!@#$%^&*(";
static const char KB_ROW3_SYM[]   = ")-_+=[]";

// Colors (RGB565 format)
#define COLOR_BACKGROUND    TFT_BLACK
#define COLOR_TIME          TFT_CYAN
#define COLOR_DATE          TFT_WHITE
#define COLOR_SYNC_OK       TFT_GREEN
#define COLOR_SYNC_FAIL     TFT_RED
#define COLOR_SYNC_PENDING  TFT_YELLOW
#define COLOR_CHART_BAR     TFT_GREEN
#define COLOR_CHART_GRID    0x4208  // Dark gray (RGB565: R=8, G=65, B=8)
#define COLOR_CHART_BAR_DIM 0x0400  // Very dark green (RGB565: R=0, G=32, B=0)
#define COLOR_TEXT_DIM      TFT_DARKGREY

// ============================================================================
// Interrupt Service Routine
// ============================================================================
void IRAM_ATTR es100ISR() {
    es100InterruptFlag = true;
}

// ============================================================================
// Battery Percentage (LiPo discharge curve)
// ============================================================================

/**
 * @brief Convert battery voltage to percentage using LiPo discharge curve
 * @param mv Battery voltage in millivolts
 * @return Percentage (0-100)
 * @details Uses a lookup table with linear interpolation between points.
 *          Approximates a typical single-cell LiPo at moderate discharge rate.
 *          The LiPo curve is nonlinear: flat plateau at ~3.7-3.9V, steep
 *          drop-off below 3.5V and above 4.1V.
 */
int lipoBatteryPercent(uint16_t mv) {
    // Voltage (mV) → Percentage lookup table
    static const uint16_t voltTable[] = {
        3300, 3500, 3600, 3700, 3750, 3800, 3850, 3900, 3950, 4000, 4100, 4200
    };
    static const uint8_t pctTable[] = {
           0,    5,   10,   20,   30,   40,   50,   60,   70,   80,   90,  100
    };
    static const int tableSize = sizeof(voltTable) / sizeof(voltTable[0]);

    if (mv <= voltTable[0]) return 0;
    if (mv >= voltTable[tableSize - 1]) return 100;

    // Linear interpolation between surrounding table entries
    for (int i = 1; i < tableSize; i++) {
        if (mv <= voltTable[i]) {
            int rangeMv  = voltTable[i] - voltTable[i - 1];
            int rangePct = pctTable[i]  - pctTable[i - 1];
            return pctTable[i - 1] + (int32_t)(mv - voltTable[i - 1]) * rangePct / rangeMv;
        }
    }
    return 100;
}

// ============================================================================
// Display Functions
// ============================================================================
void initDisplay() {
    Serial.println("[DISPLAY] Starting AMOLED initialization...");

    // Initialize LilyGo AMOLED - auto-detects board type
    if (!amoled.begin()) {
        Serial.println("[DISPLAY] ERROR: AMOLED initialization failed!");
        Serial.println("[DISPLAY] Check power connections and board selection");
        while (1) {
            delay(1000);
            Serial.println("[DISPLAY] HALTED - AMOLED init failed");
        }
    }
    Serial.println("[DISPLAY] AMOLED initialized successfully");

    // IMPORTANT: Give the display time to fully initialize
    delay(100);

    // Set display to landscape orientation
    // Rotation values for this display: 0/2=landscape (536x240), 1/3=portrait (240x536)
    amoled.setRotation(0);  // Landscape mode: 536 wide x 240 tall

    // Get display dimensions from the AMOLED object
    DISPLAY_WIDTH = amoled.width();
    DISPLAY_HEIGHT = amoled.height();

    Serial.printf("Display initialized: %d x %d\n", DISPLAY_WIDTH, DISPLAY_HEIGHT);

