MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Clear status area
    sprite.fillRect(0, STATUS_Y, DISPLAY_WIDTH, 70, COLOR_BACKGROUND);
    
    // Get sync status
    unsigned long lastSync = receptionHistory.getLastSuccessTime();
    int totalSuccess = receptionHistory.getTotalSuccessCount();
    int total48h = receptionHistory.getRecentSuccessCount();
    
    if (!es100Available) {
        snprintf(statusStr, sizeof(statusStr), "ES100 RETRY %d", es100InitRetries);
        statusColor = COLOR_SYNC_PENDING;
    } else if (es100Receiving) {
        snprintf(statusStr, sizeof(statusStr), es100UsingTracking ? "TRACKING..." : "SYNCING...");
        statusColor = COLOR_SYNC_PENDING;
    } else if (lastSync == 0) {
        snprintf(statusStr, sizeof(statusStr), "NO SYNC YET");
        statusColor = COLOR_SYNC_FAIL;
    } else {
        unsigned long elapsed = (millis() - lastSync) / 1000;
        int hours = elapsed / 3600;
        int mins = (elapsed % 3600) / 60;
        
        if (hours > 0) {
            snprintf(statusStr, sizeof(statusStr), "Last sync: %dh %dm ago", hours, mins);
        } else {
            snprintf(statusStr, sizeof(statusStr), "Last sync: %dm ago", mins);
        }
        
        if (elapsed < 7200) {
            statusColor = COLOR_SYNC_OK;
        } else if (elapsed < 86400) {
            statusColor = COLOR_SYNC_PENDING;
        } else {
            statusColor = COLOR_SYNC_FAIL;
        }
    }
    
    drawCenteredText(statusStr, STATUS_Y, statusColor, 2);
    
    // Draw time source and reception stats
    const char* srcName = "---";
    switch (lastTimeSource) {
        case TIME_SRC_WWVB: srcName = "WWVB"; break;
        case TIME_SRC_NTP:  srcName = "NTP";  break;
        case TIME_SRC_RTC:  srcName = "RTC";  break;
        default: break;
    }
    char statsStr[64];
    snprintf(statsStr, sizeof(statsStr), "Src: %s | 48h: %d syncs | Total: %d",
             srcName, total48h, totalSuccess);
    drawCenteredText(statsStr, STATUS_Y + 35, COLOR_TEXT_DIM, 1);

    // Draw DST indicator if active
    if (dstActive) {
        sprite.setTextSize(1);
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.setTextDatum(TR_DATUM);
        sprite.drawString("DST", DISPLAY_WIDTH - 5, STATUS_Y);
    }
}

void drawReceptionChart() {
    // Chart area dimensions
    int chartX = 25;
    int chartWidth = DISPLAY_WIDTH - 50;
    int chartHeight = CHART_HEIGHT - 40;
    int chartBottom = CHART_Y + 15 + chartHeight;
    
    // Clear chart area
    sprite.fillRect(0, CHART_Y, DISPLAY_WIDTH, CHART_HEIGHT + 30, COLOR_BACKGROUND);
    
    // Draw chart title
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
    sprite.setTextDatum(TL_DATUM);
    sprite.drawString("WWVB Reception History (48h)", chartX, CHART_Y);
    
    // Draw chart frame
    sprite.drawRect(chartX - 1, CHART_Y + 15, chartWidth + 2, chartHeight + 2, COLOR_CHART_GRID);
    
    // Draw horizontal grid lines
    for (int i = 1; i < 4; i++) {
        int y = CHART_Y + 15 + (chartHeight * i / 4);
        sprite.drawFastHLine(chartX, y, chartWidth, COLOR_CHART_GRID);
    }
    
    // Get history data
    uint8_t data[48];
    receptionHistory.getHistoryData(data);
    uint8_t maxVal = receptionHistory.getMaxValue();
    if (maxVal < 1) maxVal = 1;
    
    // Calculate bar width
    float barWidth = (float)chartWidth / 48.0f;
    
    // Draw bars with bounds checking
    for (int i = 0; i < 48; i++) {
        if (data[i] > 0) {
            // Calculate bar height with bounds checking
            int barHeight = (data[i] * (chartHeight - 5)) / maxVal;
            if (barHeight < 2) barHeight = 2;
            if (barHeight > chartHeight) barHeight = chartHeight;  // Clamp to max height

            int x = chartX + (int)(i * barWidth);
            int y = chartBottom - barHeight;
            int w = (int)barWidth - 1;
            if (w < 1) w = 1;

            // Ensure bar stays within chart bounds
            if (y < CHART_Y + 15) y = CHART_Y + 15;
            if (y + barHeight > chartBottom) barHeight = chartBottom - y;

            // Color based on success count
            uint16_t barColor = (data[i] >= 2) ? COLOR_CHART_BAR : COLOR_CHART_BAR_DIM;
            sprite.fillRect(x, y, w, barHeight, barColor);
        }
    }
    
    // Draw time labels
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
    
    sprite.setTextDatum(TL_DATUM);
    sprite.drawString("-48h", chartX - 5, chartBottom + 5);
    
    sprite.setTextDatum(TC_DATUM);
    sprite.drawString("-24h", chartX + chartWidth/2, chartBottom + 5);
    
    sprite.setTextDatum(TR_DATUM);
    sprite.drawString("Now", chartX + chartWidth + 5, chartBottom + 5);
    
    // Draw Y-axis labels
    sprite.setTextDatum(TL_DATUM);
    char maxStr[8];
    snprintf(maxStr, sizeof(maxStr), "%d", maxVal);
    sprite.drawString(maxStr, 2, CHART_Y + 20);
    sprite.drawString("0", 2, chartBottom - 5);
}

void drawTemperature() {
    if (!rtcAvailable) {
        return;  // Don't draw if RTC not available
    }

    char tempStr[16];
    // Convert Celsius to Fahrenheit
    float tempF = (rtcTemperature * 9.0 / 5.0) + 32.0;

    // Format complete string with degree symbol and F
    // Using 'o' as degree symbol approximation
    snprintf(tempStr, sizeof(tempStr), "%.1foF", tempF);

    // Draw in top-right corner
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
    sprite.setTextDatum(TR_DATUM);  // Top-right alignment

    sprite.drawString(tempStr, DISPLAY_WIDTH - 2, 2);
}

// ============================================================================
// Brightness Settings Page
// ============================================================================
void drawSettingsPage() {
    sprite.fillSprite(COLOR_BACKGROUND);

    // Title
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
    sprite.setTextDatum(TL_DATUM);
    sprite.drawString("SETTINGS", DISPLAY_WIDTH / 2, 10);

