MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Battery level — top right
    uint16_t battMv = amoled.getBattVoltage();
    if (battMv > 0) {
        int battPct = lipoBatteryPercent(battMv);
        char battStr[24];
        if (amoled.isCharging()) {
            snprintf(battStr, sizeof(battStr), "CHG %d%% %.2fV", battPct, battMv / 1000.0);
        } else {
            snprintf(battStr, sizeof(battStr), "BAT %d%% %.2fV", battPct, battMv / 1000.0);
        }
        sprite.setTextSize(1);
        sprite.setTextColor(battPct > 20 ? COLOR_SYNC_OK : COLOR_SYNC_FAIL, COLOR_BACKGROUND);
        sprite.setTextDatum(TR_DATUM);
        sprite.drawString(battStr, DISPLAY_WIDTH - 5, 40);
    }

    // Subtitle
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_DATE, COLOR_BACKGROUND);
    sprite.setTextDatum(TC_DATUM);
    sprite.drawString("Screen Brightness", DISPLAY_WIDTH / 2, 65);

    // Slider track (dark background)
    sprite.fillRoundRect(sliderX, sliderY, sliderWidth, sliderHeight, 6, COLOR_CHART_GRID);

    // Slider fill (proportional to brightness)
    int fillWidth = map(currentBrightness, BRIGHTNESS_MIN, BRIGHTNESS_MAX, 0, sliderWidth);
    if (fillWidth > 0) {
        sprite.fillRoundRect(sliderX, sliderY, fillWidth, sliderHeight, 6, COLOR_TIME);
    }

    // Slider knob
    int knobX = sliderX + fillWidth - 3;
    if (knobX < sliderX) knobX = sliderX;
    sprite.fillRoundRect(knobX, sliderY - 4, 6, sliderHeight + 8, 3, COLOR_DATE);

    // Min/Max labels
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
    sprite.setTextDatum(TL_DATUM);
    sprite.drawString("Min", sliderX, sliderY + sliderHeight + 8);
    sprite.setTextDatum(TR_DATUM);
    sprite.drawString("Max", sliderX + sliderWidth, sliderY + sliderHeight + 8);

    // WiFi disable/enable button — bottom left
    int btnW = 120;
    int btnH = 26;
    int btnX = 10;
    int btnY = DISPLAY_HEIGHT - btnH - 6;
    bool wifiOn = (wifiState != WIFI_STATE_OFF);
    uint16_t btnColor = wifiOn ? COLOR_SYNC_FAIL : COLOR_SYNC_OK;
    const char* btnLabel = wifiOn ? "Disable WiFi" : "Enable WiFi";
    sprite.fillRoundRect(btnX, btnY, btnW, btnH, 6, btnColor);
    sprite.setTextSize(1);
    sprite.setTextColor(TFT_WHITE, btnColor);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString(btnLabel, btnX + btnW / 2, btnY + btnH / 2);

    // UTC Offset control — bottom right
    // Layout: "UTC" label [-] value [+]
    int utcBtnW = 30, utcBtnH = 26;
    int utcRightEdge = DISPLAY_WIDTH - 10;
    int utcBtnY = btnY;  // Same row as WiFi button

    // [+] button (rightmost)
    int utcPlusX = utcRightEdge - utcBtnW;
    sprite.fillRoundRect(utcPlusX, utcBtnY, utcBtnW, utcBtnH, 4, COLOR_CHART_GRID);
    sprite.setTextColor(TFT_WHITE, COLOR_CHART_GRID);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("+", utcPlusX + utcBtnW / 2, utcBtnY + utcBtnH / 2);

    // Offset value
    char offsetStr[16];
    snprintf(offsetStr, sizeof(offsetStr), "UTC%+d", utcOffset);
    sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
    sprite.setTextDatum(MC_DATUM);
    int valueX = utcPlusX - 45;
    sprite.drawString(offsetStr, valueX, utcBtnY + utcBtnH / 2);

    // [-] button
    int utcMinusX = valueX - 55 - utcBtnW / 2;
    sprite.fillRoundRect(utcMinusX, utcBtnY, utcBtnW, utcBtnH, 4, COLOR_CHART_GRID);
    sprite.setTextColor(TFT_WHITE, COLOR_CHART_GRID);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("-", utcMinusX + utcBtnW / 2, utcBtnY + utcBtnH / 2);
}

// ============================================================================
// Shutdown Overlay
// ============================================================================
void drawShutdownOverlay(unsigned long holdDuration) {
    // Only show after SHUTDOWN_FEEDBACK_MS of holding
    if (holdDuration < SHUTDOWN_FEEDBACK_MS) return;

    unsigned long remaining = SHUTDOWN_HOLD_MS - holdDuration;
    int seconds = (remaining + 999) / 1000;  // Round up

    // Semi-transparent overlay effect: dark rectangle
    sprite.fillRect(0, DISPLAY_HEIGHT / 2 - 40, DISPLAY_WIDTH, 80, TFT_BLACK);
    sprite.drawRect(0, DISPLAY_HEIGHT / 2 - 40, DISPLAY_WIDTH, 80, COLOR_SYNC_FAIL);

    // Countdown text
    char msg[32];
    snprintf(msg, sizeof(msg), "Shutdown in %d...", seconds);
    sprite.setTextSize(2);
    sprite.setTextColor(COLOR_SYNC_FAIL, TFT_BLACK);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString(msg, DISPLAY_WIDTH / 2, DISPLAY_HEIGHT / 2 - 10);

    // Progress bar
    int barX = 40;
    int barW = DISPLAY_WIDTH - 80;
    int barY = DISPLAY_HEIGHT / 2 + 15;
    int barH = 8;
    sprite.drawRect(barX, barY, barW, barH, COLOR_SYNC_FAIL);
    float progress = (float)(holdDuration - SHUTDOWN_FEEDBACK_MS) / (SHUTDOWN_HOLD_MS - SHUTDOWN_FEEDBACK_MS);
    if (progress > 1.0f) progress = 1.0f;
    sprite.fillRect(barX + 1, barY + 1, (int)((barW - 2) * progress), barH - 2, COLOR_SYNC_FAIL);
}

// ============================================================================
// Deep Sleep Shutdown
// ============================================================================
void performShutdown() {
    Serial.println("[SHUTDOWN] Initiating deep sleep...");

    // Show shutdown message
    sprite.fillSprite(TFT_BLACK);
    sprite.setTextSize(2);
    sprite.setTextColor(COLOR_SYNC_FAIL, TFT_BLACK);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("Shutting down...", DISPLAY_WIDTH / 2, DISPLAY_HEIGHT / 2);
    pushDisplay();

    // Save brightness to preferences
    preferences.begin("wwvb", false);
    preferences.putUChar("brightness", currentBrightness);
    preferences.end();
    Serial.printf("[SHUTDOWN] Brightness %d saved\n", currentBrightness);

    // Save current time
    saveTimeToPreferences();

    delay(1500);

    // Turn off display
    amoled.setBrightness(0);

    // Configure touch pin as wakeup source (touch press pulls IRQ low)
    esp_sleep_enable_ext0_wakeup(GPIO_NUM_21, 0);
    Serial.println("[SHUTDOWN] Entering deep sleep (touch to wake)");
    Serial.flush();

    esp_deep_sleep_start();
}

// ============================================================================
// Brightness Slider Touch Handling
// ============================================================================
void handleSliderTouch(int16_t x, int16_t y) {
    // Check if touch is in the slider area (with padding)
    if (y >= (sliderY - sliderTouchPadding) && y <= (sliderY + sliderHeight + sliderTouchPadding) &&
        x >= sliderX && x <= (sliderX + sliderWidth)) {
        // Map touch X position to brightness
        int newBrightness = map(x, sliderX, sliderX + sliderWidth, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
        newBrightness = constrain(newBrightness, BRIGHTNESS_MIN, BRIGHTNESS_MAX);

        if (newBrightness != currentBrightness) {
            currentBrightness = newBrightness;
            amoled.setBrightness(currentBrightness);
        }
        sliderDragging = true;
    }
}

// ============================================================================
// WiFi Management Functions
// ============================================================================
void wifiScan() {
    // Ensure WiFi is in STA mode and disconnected (but NOT stopped)
    WiFi.mode(WIFI_STA);
    WiFi.setMinSecurity(WIFI_AUTH_WEP);  // Allow all security types including WPA/mixed
    WiFi.disconnect();      // Disconnect without stopping WiFi driver
    delay(100);

