MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
// Returns the character for a keyboard tap, or special codes:
// '\b' = backspace, '\n' = connect, '\t' = shift toggle, '\r' = 123 toggle, ' ' = space
// '\x01' = show/hide toggle, '\0' = no key hit
char getKeyFromTap(int16_t x, int16_t y) {
    // Check show/hide toggle on input field
    if (y >= KB_INPUT_Y && y <= KB_INPUT_Y + KB_INPUT_HEIGHT && x >= DISPLAY_WIDTH - 40) {
        return '\x01';
    }

    // Must be in keyboard area
    if (y < KB_Y_OFFSET) return '\0';

    int row = (y - KB_Y_OFFSET) / (KB_KEY_HEIGHT + KB_KEY_GAP);
    int16_t rowY = KB_Y_OFFSET + row * (KB_KEY_HEIGHT + KB_KEY_GAP);
    if (y > rowY + KB_KEY_HEIGHT) return '\0';  // In the gap

    const char* row1 = (kbMode == KB_SYMBOLS) ? KB_ROW1_SYM : (kbMode == KB_UPPER) ? KB_ROW1_UPPER : KB_ROW1_LOWER;
    const char* row2 = (kbMode == KB_SYMBOLS) ? KB_ROW2_SYM : (kbMode == KB_UPPER) ? KB_ROW2_UPPER : KB_ROW2_LOWER;
    const char* row3 = (kbMode == KB_SYMBOLS) ? KB_ROW3_SYM : (kbMode == KB_UPPER) ? KB_ROW3_UPPER : KB_ROW3_LOWER;

    if (row == 0) {
        // Row 1: 10 keys starting at KB_ROW1_X
        int col = (x - KB_ROW1_X) / (KB_KEY_WIDTH + KB_KEY_GAP);
        if (col >= 0 && col < 10 && x >= KB_ROW1_X) return row1[col];
    } else if (row == 1) {
        // Row 2: 9 keys starting at KB_ROW2_X
        int col = (x - KB_ROW2_X) / (KB_KEY_WIDTH + KB_KEY_GAP);
        if (col >= 0 && col < 9 && x >= KB_ROW2_X) return row2[col];
    } else if (row == 2) {
        // Row 3: Shift + letters + Backspace
        if (x < KB_ROW3_X + KB_SPECIAL_WIDTH) return '\t';  // Shift
        int16_t row3KeyX = KB_ROW3_X + KB_SPECIAL_WIDTH + KB_KEY_GAP;
        int row3Len = strlen(row3);
        int16_t bsX = row3KeyX + row3Len * (KB_KEY_WIDTH + KB_KEY_GAP);
        if (x >= bsX) return '\b';  // Backspace
        int col = (x - row3KeyX) / (KB_KEY_WIDTH + KB_KEY_GAP);
        if (col >= 0 && col < row3Len) return row3[col];
    } else if (row == 3) {
        // Row 4: 123 + Space + Connect
        if (x < KB_ROW4_X + KB_SPECIAL_WIDTH) return '\r';  // 123/abc toggle
        int16_t spaceX = KB_ROW4_X + KB_SPECIAL_WIDTH + KB_KEY_GAP;
        int16_t connectX = spaceX + KB_SPACE_WIDTH + KB_KEY_GAP;
        if (x >= connectX) return '\n';  // Connect
        if (x >= spaceX && x < spaceX + KB_SPACE_WIDTH) return ' ';  // Space
    }

    return '\0';
}

void processKeyboardInput(char key) {
    if (key == '\0') return;

    if (key == '\x01') {
        // Toggle password visibility
        passwordVisible = !passwordVisible;
    } else if (key == '\t') {
        // Shift toggle
        if (kbMode == KB_LOWER) kbMode = KB_UPPER;
        else if (kbMode == KB_UPPER) kbMode = KB_LOWER;
    } else if (key == '\r') {
        // 123/abc toggle
        if (kbMode == KB_SYMBOLS) kbMode = KB_LOWER;
        else kbMode = KB_SYMBOLS;
    } else if (key == '\b') {
        // Backspace
        if (passwordLen > 0) {
            passwordLen--;
            passwordBuffer[passwordLen] = '\0';
        }
    } else if (key == '\n') {
        // Connect button pressed
        if (selectedNetwork >= 0 && selectedNetwork < scannedCount) {
            String ssid = scannedSSIDs[selectedNetwork];
            String pass = String(passwordBuffer);
            kbMode = KB_HIDDEN;
            wifiConnect(ssid, pass);
        }
    } else if (key == ' ' || (key >= 32 && key <= 126)) {
        // Regular character
        if (passwordLen < KB_PASSWORD_MAX) {
            passwordBuffer[passwordLen] = key;
            passwordLen++;
            passwordBuffer[passwordLen] = '\0';
            // Auto-revert to lowercase after typing one uppercase letter
            if (kbMode == KB_UPPER) kbMode = KB_LOWER;
        }
    }
}

// ============================================================================
// WiFi Page Drawing
// ============================================================================
void drawSignalBars(int16_t x, int16_t y, int8_t rssi) {
    // Draw 4 signal bars based on RSSI
    int bars = 0;
    if (rssi > -50) bars = 4;
    else if (rssi > -60) bars = 3;
    else if (rssi > -70) bars = 2;
    else if (rssi > -80) bars = 1;

    for (int i = 0; i < 4; i++) {
        int barH = 4 + i * 3;
        int barY = y + 14 - barH;
        uint16_t color = (i < bars) ? COLOR_SYNC_OK : COLOR_CHART_GRID;
        sprite.fillRect(x + i * 5, barY, 3, barH, color);
    }
}

void drawWiFiButton(int16_t x, int16_t y, int16_t w, int16_t h, const char* label, uint16_t bgColor) {
    sprite.fillRoundRect(x, y, w, h, 4, bgColor);
    sprite.setTextColor(TFT_BLACK, bgColor);
    sprite.setTextDatum(MC_DATUM);
    sprite.setTextSize(1);
    sprite.drawString(label, x + w / 2, y + h / 2);
}

void drawWiFiPageStatus() {
    // Title (same size as status text)
    sprite.setTextSize(1);
    sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
    sprite.setTextDatum(TL_DATUM);
    sprite.drawString("WiFi", 10, 10);

    // Centered radio status
    sprite.setTextSize(1);
    sprite.setTextDatum(TC_DATUM);
    if (wifiState == WIFI_STATE_OFF) {
        sprite.setTextColor(COLOR_SYNC_FAIL, COLOR_BACKGROUND);
        sprite.drawString("WiFi Disabled", DISPLAY_WIDTH / 2, 10);
    } else {
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.drawString("WiFi Enabled", DISPLAY_WIDTH / 2, 10);
    }

    // Status indicator (top right)
    sprite.setTextSize(1);
    sprite.setTextDatum(TR_DATUM);
    if (wifiState == WIFI_STATE_CONNECTED) {
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.drawString("Connected", DISPLAY_WIDTH - 10, 5);
        // Show IP, NTP, RSSI on first row; SSID on second row
        sprite.setTextDatum(TL_DATUM);
        sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
        sprite.drawString(WiFi.localIP().toString().c_str(), 10, 30);

        char ntpStr[32];
        snprintf(ntpStr, sizeof(ntpStr), "NTP: %lu req", (unsigned long)ntpServer.getRequestCount());
        sprite.setTextDatum(TC_DATUM);
        sprite.drawString(ntpStr, DISPLAY_WIDTH / 2, 30);

        char rssiStr[16];
        snprintf(rssiStr, sizeof(rssiStr), "%d dBm", WiFi.RSSI());
        sprite.setTextDatum(TR_DATUM);
        sprite.drawString(rssiStr, DISPLAY_WIDTH - 10, 30);

        sprite.setTextDatum(TL_DATUM);
        sprite.drawString(wifiSSID.c_str(), 10, 55);
    } else if (wifiState == WIFI_STATE_SCANNING) {
        sprite.setTextColor(COLOR_SYNC_PENDING, COLOR_BACKGROUND);
        sprite.drawString("Scanning...", DISPLAY_WIDTH - 10, 5);
    } else if (wifiState == WIFI_STATE_CONNECTING) {
        sprite.setTextColor(COLOR_SYNC_PENDING, COLOR_BACKGROUND);
        sprite.drawString("Connecting...", DISPLAY_WIDTH - 10, 5);
    } else if (wifiState == WIFI_STATE_AP_MODE) {
        sprite.setTextColor(COLOR_SYNC_PENDING, COLOR_BACKGROUND);
        sprite.drawString("AP Mode", DISPLAY_WIDTH - 10, 5);
    } else if (wifiState == WIFI_STATE_OFF) {
        sprite.setTextColor(COLOR_SYNC_FAIL, COLOR_BACKGROUND);
        sprite.drawString("Disabled", DISPLAY_WIDTH - 10, 5);
    } else {
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.drawString("Enabled", DISPLAY_WIDTH - 10, 5);
    }

    // Error message
    if (wifiErrorMsg.length() > 0) {
        sprite.setTextDatum(TC_DATUM);
        sprite.setTextColor(COLOR_SYNC_FAIL, COLOR_BACKGROUND);
        sprite.drawString(wifiErrorMsg.c_str(), DISPLAY_WIDTH / 2, 32);
    }
}

void drawWiFiNetworkList() {
    // Separator line
    sprite.drawFastHLine(0, 48, DISPLAY_WIDTH, COLOR_CHART_GRID);

    int16_t listY = 52;
    int16_t rowH = 24;

    if (scannedCount == 0) {
        sprite.setTextSize(1);
        sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
        sprite.setTextDatum(MC_DATUM);
        sprite.drawString("No networks found. Tap Scan.", DISPLAY_WIDTH / 2, listY + 60);
        return;
    }

