MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    int visibleCount = min((int)scannedCount - listScrollOffset, (int)WIFI_MAX_VISIBLE);
    for (int i = 0; i < visibleCount; i++) {
        int idx = i + listScrollOffset;
        int16_t rowTop = listY + i * rowH;

        // Highlight selected network
        if (idx == selectedNetwork) {
            sprite.fillRect(0, rowTop, DISPLAY_WIDTH, rowH, 0x2104);
        }

        // Connected indicator
        if (wifiState == WIFI_STATE_CONNECTED && scannedSSIDs[idx] == wifiSSID) {
            sprite.setTextColor(COLOR_SYNC_OK, (idx == selectedNetwork) ? 0x2104 : COLOR_BACKGROUND);
            sprite.setTextDatum(TL_DATUM);
            sprite.setTextSize(1);
            sprite.drawString(">", 4, rowTop + 6);
        }

        // SSID name
        uint16_t bg = (idx == selectedNetwork) ? 0x2104 : COLOR_BACKGROUND;
        sprite.setTextColor(COLOR_DATE, bg);
        sprite.setTextDatum(TL_DATUM);
        sprite.setTextSize(1);

        // Truncate long SSIDs
        String displaySSID = scannedSSIDs[idx];
        if (displaySSID.length() > 28) {
            displaySSID = displaySSID.substring(0, 25) + "...";
        }
        sprite.drawString(displaySSID.c_str(), 14, rowTop + 6);

        // Signal bars
        drawSignalBars(DISPLAY_WIDTH - 60, rowTop + 4, scannedRSSI[idx]);

        // Lock icon for secured networks
        if (scannedSecure[idx]) {
            sprite.setTextColor(COLOR_SYNC_PENDING, bg);
            sprite.setTextDatum(TR_DATUM);
            sprite.drawString("Lock", DISPLAY_WIDTH - 8, rowTop + 6);
        }
    }

    // Scroll indicator if there are more networks
    if (scannedCount > WIFI_MAX_VISIBLE) {
        sprite.setTextSize(1);
        sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
        sprite.setTextDatum(TC_DATUM);
        char scrollStr[16];
        snprintf(scrollStr, sizeof(scrollStr), "%d/%d", listScrollOffset + 1, scannedCount);
        sprite.drawString(scrollStr, DISPLAY_WIDTH / 2, listY + WIFI_MAX_VISIBLE * rowH + 2);
    }
}

void drawWiFiPage() {
    sprite.fillSprite(COLOR_BACKGROUND);

    if (kbMode != KB_HIDDEN) {
        // Keyboard sub-view
        sprite.setTextSize(1);
        sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
        sprite.setTextDatum(TL_DATUM);
        if (selectedNetwork >= 0 && selectedNetwork < scannedCount) {
            String title = "Connect to: " + scannedSSIDs[selectedNetwork];
            sprite.drawString(title.c_str(), 10, 5);
        }
        drawKeyboard();
    } else if (wifiState == WIFI_STATE_CONNECTING) {
        // Connecting sub-view
        drawWiFiPageStatus();
        sprite.setTextSize(2);
        sprite.setTextColor(COLOR_SYNC_PENDING, COLOR_BACKGROUND);
        sprite.setTextDatum(MC_DATUM);
        sprite.drawString("Connecting...", DISPLAY_WIDTH / 2, DISPLAY_HEIGHT / 2 - 20);

        // Progress bar
        unsigned long elapsed = millis() - wifiConnectStart;
        float progress = (float)elapsed / WIFI_CONNECT_TIMEOUT;
        if (progress > 1.0f) progress = 1.0f;
        int barW = DISPLAY_WIDTH - 80;
        sprite.drawRect(40, DISPLAY_HEIGHT / 2 + 10, barW, 8, COLOR_CHART_GRID);
        sprite.fillRect(41, DISPLAY_HEIGHT / 2 + 11, (int)((barW - 2) * progress), 6, COLOR_SYNC_PENDING);

        // Cancel button
        drawWiFiButton(DISPLAY_WIDTH / 2 - 50, DISPLAY_HEIGHT - 35, 100, 26, "Cancel", COLOR_SYNC_FAIL);
    } else if (wifiState == WIFI_STATE_AP_MODE) {
        // AP Mode sub-view
        sprite.setTextSize(2);
        sprite.setTextColor(COLOR_TIME, COLOR_BACKGROUND);
        sprite.setTextDatum(TC_DATUM);
        sprite.drawString("AP Mode Active", DISPLAY_WIDTH / 2, 10);

        sprite.setTextSize(1);
        sprite.setTextColor(COLOR_DATE, COLOR_BACKGROUND);
        sprite.setTextDatum(TL_DATUM);
        sprite.drawString("Network:", 30, 60);
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.drawString(WIFI_AP_SSID, 110, 60);

        sprite.setTextColor(COLOR_DATE, COLOR_BACKGROUND);
        sprite.drawString("Password:", 30, 80);
        sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
        sprite.drawString("(none)", 110, 80);

        sprite.setTextColor(COLOR_DATE, COLOR_BACKGROUND);
        sprite.drawString("IP:", 30, 100);
        sprite.setTextColor(COLOR_SYNC_OK, COLOR_BACKGROUND);
        sprite.drawString("192.168.4.1", 110, 100);

        sprite.setTextColor(COLOR_TEXT_DIM, COLOR_BACKGROUND);
        sprite.setTextDatum(TC_DATUM);
        sprite.drawString("Connect your phone to this", DISPLAY_WIDTH / 2, 135);
        sprite.drawString("network, then open a browser.", DISPLAY_WIDTH / 2, 150);

        drawWiFiButton(DISPLAY_WIDTH / 2 - 50, DISPLAY_HEIGHT - 35, 100, 26, "Stop AP", COLOR_SYNC_FAIL);
    } else {
        // Main WiFi page: status + network list + buttons
        drawWiFiPageStatus();
        drawWiFiNetworkList();

        // Bottom buttons
        drawWiFiButton(40, DISPLAY_HEIGHT - 30, 130, 26, "Scan", COLOR_TIME);
        if (wifiState == WIFI_STATE_CONNECTED) {
            drawWiFiButton(DISPLAY_WIDTH / 2 - 55, DISPLAY_HEIGHT - 30, 110, 26, "Sync NTP", COLOR_SYNC_OK);
        }
        drawWiFiButton(DISPLAY_WIDTH - 170, DISPLAY_HEIGHT - 30, 130, 26, "Start AP", COLOR_SYNC_PENDING);
    }

}

// ============================================================================
// WiFi Page Touch Handling
// ============================================================================
void handleWiFiTap(int16_t x, int16_t y) {
    if (kbMode != KB_HIDDEN) {
        // Keyboard is visible — process key tap
        char key = getKeyFromTap(x, y);
        processKeyboardInput(key);
        return;
    }

    if (wifiState == WIFI_STATE_CONNECTING) {
        // Cancel button
        if (y >= DISPLAY_HEIGHT - 35 && y <= DISPLAY_HEIGHT - 9 &&
            x >= DISPLAY_WIDTH / 2 - 50 && x <= DISPLAY_WIDTH / 2 + 50) {
            WiFi.disconnect();
            wifiState = WIFI_STATE_IDLE;
            wifiErrorMsg = "Cancelled";
            Serial.println("[WIFI] Connection cancelled");
        }
        return;
    }

    if (wifiState == WIFI_STATE_AP_MODE) {
        // Stop AP button
        if (y >= DISPLAY_HEIGHT - 35 && y <= DISPLAY_HEIGHT - 9 &&
            x >= DISPLAY_WIDTH / 2 - 50 && x <= DISPLAY_WIDTH / 2 + 50) {
            wifiStopAP();
        }
        return;
    }

    // Main page buttons
    // Scan button: X:40-170, Y: DISPLAY_HEIGHT-30 to DISPLAY_HEIGHT-4
    if (y >= DISPLAY_HEIGHT - 30 && y <= DISPLAY_HEIGHT - 4) {
        if (x >= 40 && x <= 170) {
            wifiScan();
            return;
        }
        // Sync NTP button (center, only when connected)
        if (wifiState == WIFI_STATE_CONNECTED &&
            x >= DISPLAY_WIDTH / 2 - 55 && x <= DISPLAY_WIDTH / 2 + 55) {
            Serial.println("[WIFI] Sync NTP button pressed");
            ntpClientSync();
            return;
        }
        if (x >= DISPLAY_WIDTH - 170 && x <= DISPLAY_WIDTH - 40) {
            wifiStartAP();
            return;
        }
    }

    // Network list tap: Y between 52 and 52 + WIFI_MAX_VISIBLE * 24
    int16_t listY = 52;
    int16_t rowH = 24;
    if (y >= listY && y < listY + WIFI_MAX_VISIBLE * rowH && scannedCount > 0) {
        int tapIdx = (y - listY) / rowH + listScrollOffset;
        if (tapIdx >= 0 && tapIdx < scannedCount) {
            selectedNetwork = tapIdx;
            Serial.printf("[WIFI] Selected network: %s\n", scannedSSIDs[tapIdx].c_str());

