MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    // Only set source to RTC if no better source has synced
    if (lastTimeSource == TIME_SRC_NONE) {
        lastTimeSource = TIME_SRC_RTC;
        lastTimeSyncMillis = millis();
        snapshotSyncTime();
    }

    return true;
}

void saveTimeToDS3231() {
    if (!rtcAvailable) {
        return;
    }

    ClockTime utc = timeManager.getUTCTime();
    rtc.adjust(DateTime(utc.year, utc.month, utc.day,
                       utc.hour, utc.minute, utc.second));

    Serial.printf("Saved time to DS3231: %04d-%02d-%02d %02d:%02d:%02d UTC\n",
                 utc.year, utc.month, utc.day,
                 utc.hour, utc.minute, utc.second);
}

void syncFromDS3231() {
    if (!rtcAvailable) {
        return;
    }

    // Read DS3231 as the authoritative time source every call
    // The DS3231 TCXO is ±2 ppm vs ESP32 crystal at ±20 ppm
    DateTime rtcTime = rtc.now();

    // Sanity check
    if (rtcTime.year() < 2025 || rtcTime.year() > 2100) {
        return;
    }

    // Always set TimeManager from the DS3231
    ClockTime currentTime = timeManager.getUTCTime();
    if (currentTime.hour != rtcTime.hour() ||
        currentTime.minute != rtcTime.minute() ||
        currentTime.second != rtcTime.second() ||
        currentTime.day != rtcTime.day()) {
        timeManager.setTime(rtcTime.year(), rtcTime.month(), rtcTime.day(),
                           rtcTime.hour(), rtcTime.minute(), rtcTime.second());
    }
}

void readDS3231Temperature() {
    if (!rtcAvailable) {
        rtcTemperature = 0.0;
        return;
    }

    rtcTemperature = rtc.getTemperature();
}

// ============================================================================
// NTP Client Sync (query time.nist.gov as redundant time source)
// ============================================================================
bool ntpClientSync() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("[NTP-CLIENT] Not connected to WiFi");
        return false;
    }

    Serial.println("[NTP-CLIENT] Querying time.nist.gov...");

    // Resolve DNS first so we can store the upstream IP for Stratum 2 refId
    IPAddress ntpServerIP;
    if (WiFi.hostByName("time.nist.gov", ntpServerIP) != 1) {
        Serial.println("[NTP-CLIENT] DNS resolution failed for time.nist.gov");
        return false;
    }
    Serial.printf("[NTP-CLIENT] Resolved time.nist.gov → %s\n", ntpServerIP.toString().c_str());

    WiFiUDP udp;
    if (!udp.begin(0)) {  // Ephemeral local port
        Serial.println("[NTP-CLIENT] Failed to open UDP socket");
        return false;
    }

    // Build 48-byte NTP request: LI=0, VN=4, Mode=3 (client)
    uint8_t packet[48];
    memset(packet, 0, 48);
    packet[0] = 0x23;  // 0b00_100_011

    // Send to resolved IP
    if (!udp.beginPacket(ntpServerIP, 123)) {
        Serial.println("[NTP-CLIENT] beginPacket failed");
        udp.stop();
        return false;
    }
    udp.write(packet, 48);
    udp.endPacket();

    // Wait for response (up to 2 seconds)
    unsigned long start = millis();
    int cb = 0;
    while ((cb = udp.parsePacket()) < 48) {
        if (millis() - start > 2000) {
            Serial.println("[NTP-CLIENT] Timeout waiting for response");
            udp.stop();
            return false;
        }
        delay(10);
    }

    // Read response
    udp.read(packet, 48);
    udp.stop();

    // Extract transmit timestamp (bytes 40-43, big-endian NTP seconds)
    uint32_t ntpSeconds = ((uint32_t)packet[40] << 24) |
                          ((uint32_t)packet[41] << 16) |
                          ((uint32_t)packet[42] << 8)  |
                          (uint32_t)packet[43];

    if (ntpSeconds == 0) {
        Serial.println("[NTP-CLIENT] Invalid response (zero timestamp)");
        return false;
    }

    // Convert NTP timestamp (since 1900) to Unix timestamp (since 1970)
    uint32_t unixTime = ntpSeconds - NTP_EPOCH_OFFSET;

    // Set TimeManager and DS3231
    timeManager.setUnixTime(unixTime);
    saveTimeToDS3231();

    // Track time source — NTP is Stratum 2
    // RFC 5905: Stratum 2+ reference ID = upstream server's IPv4 address
    lastTimeSource = TIME_SRC_NTP;
    lastTimeSyncMillis = millis();
    snapshotSyncTime();
    ntpServer.setStratum(2, ntpServerIP);

    // Recompute DST from calendar after NTP time update
    if (AUTO_DST_ENABLED) {
        dstActive = computeUSDST();
        Serial.printf("[DST] Auto-DST after NTP sync: %s\n", dstActive ? "active" : "inactive");
    }

    Serial.printf("[NTP-CLIENT] Synced: Unix=%lu\n", (unsigned long)unixTime);
    return true;
}

// ============================================================================
// Sync Time Snapshot
// ============================================================================
// Records the current UTC time as a formatted string in statusData.lastSyncTimeStr.
// Call immediately after setting lastTimeSyncMillis at each sync point.
void snapshotSyncTime() {
    ClockTime utc = timeManager.getUTCTime();
    snprintf(statusData.lastSyncTimeStr, sizeof(statusData.lastSyncTimeStr),
             "%04d-%02d-%02d %02d:%02d:%02d",
             utc.year, utc.month, utc.day, utc.hour, utc.minute, utc.second);
}

// ============================================================================
// ES100 Initialization Functions
// ============================================================================
bool initializeES100() {
    Serial.println("Attempting ES100 initialization...");

    if (es100.begin(&Wire1, ES100_SDA_PIN, ES100_SCL_PIN)) {
        Serial.println("ES100 initialized successfully");
        es100Available = true;
        es100InitRetries = 0;  // Reset retry counter on success
        return true;
    } else {
        Serial.printf("ES100 initialization failed (attempt %d, will retry)\n",
                     es100InitRetries + 1);
        es100Available = false;
        return false;
    }
}

bool retryES100Initialization() {
    if (es100Available) {
        return false;  // Already initialized
    }

    unsigned long now = millis();
    uint8_t retryIndex = (es100InitRetries < MAX_ES100_INIT_RETRIES) ? es100InitRetries : (MAX_ES100_INIT_RETRIES - 1);
    unsigned long retryInterval = ES100_RETRY_INTERVALS[retryIndex];

    if (now - lastES100InitAttempt >= retryInterval) {
        lastES100InitAttempt = now;
        es100InitRetries++;

        if (initializeES100()) {
            Serial.println("ES100 recovery successful!");
            return true;
        }
    }

