MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
    return false;
}

// ============================================================================
// WWVB Sync Schedule — time-aware with daytime backoff
// ============================================================================

/**
 * @brief Check if current local time is within the nighttime reception window
 * @return true if local hour is between SYNC_NIGHT_START_HOUR and SYNC_NIGHT_END_HOUR
 */
bool isNighttimeWindow() {
    if (!timeManager.isTimeSet()) return true;  // If no time yet, assume night (try aggressively)
    ClockTime local = timeManager.getLocalTime(utcOffset, dstActive);
    // Nighttime wraps midnight: e.g. 22:00 - 06:00
    return (local.hour >= SYNC_NIGHT_START_HOUR || local.hour < SYNC_NIGHT_END_HOUR);
}

/**
 * @brief Compute US DST status from the calendar
 * @details US rules: DST starts 2nd Sunday of March at 2:00 AM local standard time,
 *          ends 1st Sunday of November at 2:00 AM local standard time.
 *          Uses standard time (no DST applied) to avoid circular dependency.
 * @return true if DST should be active
 */
bool computeUSDST() {
    if (!timeManager.isTimeSet()) return false;

    // Get local STANDARD time (DST=false) to determine if DST should be active
    ClockTime local = timeManager.getLocalTime(utcOffset, false);

    // Jan, Feb, Dec: never DST
    if (local.month < 3 || local.month > 11) return false;

    // Apr through Oct: always DST
    if (local.month > 3 && local.month < 11) return true;

    // March: DST starts 2nd Sunday at 2:00 AM standard time
    if (local.month == 3) {
        int dow1 = TimeManager::calculateDayOfWeek(local.year, 3, 1);  // 0=Sunday
        int secondSunday = (1 + (7 - dow1) % 7) + 7;
        return (local.day > secondSunday) ||
               (local.day == secondSunday && local.hour >= 2);
    }

    // November: DST ends 1st Sunday at 2:00 AM standard time
    int dow1 = TimeManager::calculateDayOfWeek(local.year, 11, 1);
    int firstSunday = 1 + (7 - dow1) % 7;
    return (local.day < firstSunday) ||
           (local.day == firstSunday && local.hour < 2);
}

/**
 * @brief Get the appropriate sync interval based on time of day and failure history
 * @return Interval in milliseconds until next sync attempt
 */
unsigned long getSyncInterval() {
    // Never synced — aggressive 5-minute attempts regardless of time
    if (receptionHistory.getLastSuccessTime() == 0) {
        return SYNC_INTERVAL_INITIAL_MS;
    }

    if (isNighttimeWindow()) {
        // Nighttime: best propagation, sync every hour
        daytimeFailures = 0;
        daytimeSkipActive = false;
        return SYNC_INTERVAL_NIGHT_MS;
    }

    // Daytime: backed off after repeated failures — wait for nighttime
    if (daytimeSkipActive) {
        // Check if night has arrived to resume
        // (isNighttimeWindow() returned false, so still daytime — keep skipping)
        return SYNC_INTERVAL_DAY_MS;
    }

    // Daytime: normal 4-hour interval
    return SYNC_INTERVAL_DAY_MS;
}

/**
 * @brief Record a sync failure and activate daytime backoff if threshold reached
 */
void recordSyncFailure(bool wasTracking = false) {
    receptionHistory.recordAttempt(false);

    if (!isNighttimeWindow()) {
        uint8_t threshold = wasTracking ? SYNC_DAY_MAX_TRACKING_FAILURES : SYNC_DAY_MAX_FAILURES;
        daytimeFailures++;
        if (daytimeFailures >= threshold) {
            daytimeSkipActive = true;
            Serial.printf("[SYNC] %d consecutive daytime %s failures — skipping until nighttime\n",
                         daytimeFailures, wasTracking ? "tracking" : "normal");
        }
    }
}

// ============================================================================
// ES100 Sync Functions
// ============================================================================
void startWWVBSync() {
    if (es100Receiving) return;
    if (!es100Available) {
        lastSyncAttempt = millis();  // Prevent repeated calls
        return;
    }

    // Use tracking mode for hourly re-syncs after a successful normal decode
    uint8_t mode = ES100_CTRL0_NORMAL;
    es100UsingTracking = false;

    if (ES100_USE_TRACKING && es100TrackingReady) {
        if (millis() - es100TrackingReadySinceMs >= ES100_TRACKING_FALLBACK_MS) {
            // 24 hours without a successful sync — do a full normal-mode decode
            Serial.println("Tracking mode expired (24h without sync), switching to normal mode");
            es100TrackingReady = false;
        } else {
            mode = ES100_CTRL0_NORMAL | ES100_CTRL0_TRACKING;  // 0x11
            es100UsingTracking = true;
            Serial.println("Starting WWVB tracking mode sync...");
        }
    }
    if (!es100UsingTracking) {
        Serial.println("Starting WWVB normal mode sync...");
    }

    es100InterruptFlag = false;

    if (es100.startReception(mode)) {
        es100Receiving = true;
        lastSyncAttempt = millis();
    } else {
        Serial.println("Failed to start ES100 reception");
        es100UsingTracking = false;
        recordSyncFailure();
    }
}

void stopWWVBSync() {
    es100.stopReception();
    es100Receiving = false;
    Serial.println("WWVB sync stopped");
}

void handleES100Interrupt() {
    if (!es100InterruptFlag || !es100Receiving) return;
    
    es100InterruptFlag = false;
    
    uint8_t irqStatus = es100.readIRQStatus();
    Serial.printf("ES100 IRQ Status: 0x%02X\n", irqStatus);
    
    if (irqStatus & ES100_IRQ_RX_COMPLETE) {
        uint8_t status0 = es100.readStatus0();

        if (status0 & ES100_STATUS_RX_OK) {
            bool usedTracking = (status0 & ES100_STATUS_TRACKING) != 0;
            Serial.printf("WWVB reception successful! (%s mode)\n",
                         usedTracking ? "tracking" : "normal");

            ES100Time rxTime;
            if (es100.readDateTime(&rxTime)) {
                Serial.printf("Received UTC: %04d-%02d-%02d %02d:%02d:%02d\n",
                             rxTime.year, rxTime.month, rxTime.day,
                             rxTime.hour, rxTime.minute, rxTime.second);

                timeManager.setTime(rxTime.year, rxTime.month, rxTime.day,
                                   rxTime.hour, rxTime.minute, rxTime.second);

