MRC757/ESP32-WWVB-NTP-Time-Server/wwvb_clock.ino
                // Extract DST status from Status0 register (bits 5-6)
                // After shifting: 0=Not in effect, 1=Ends today, 2=Begins today, 3=In effect
                uint8_t dstBits = (status0 >> 5) & 0x03;

                // Apply DST if currently in effect (3) or begins today (2)
                // Don't apply if not in effect (0) or ends today (1)
                // This provides best approximation between hourly syncs
                dstActive = (dstBits >= 2);

                receptionHistory.recordAttempt(true);

                // Save time to persistent storage
                saveTimeToPreferences();
                saveTimeToDS3231();  // Also update RTC

                // Track time source
                lastTimeSource = TIME_SRC_WWVB;
                lastTimeSyncMillis = millis();
                snapshotSyncTime();
                ntpServer.setStratum(1, "WWVB");

                // Enable tracking mode for subsequent syncs; record when it was set
                // so the 24-hour fallback timer in startWWVBSync() has a reference point.
                es100TrackingReady = true;
                es100TrackingReadySinceMs = millis();

                // Reset daytime failure tracking on any successful sync
                daytimeFailures = 0;
                daytimeSkipActive = false;

                Serial.println("Time synchronized!");
            } else {
                Serial.println("Failed to read time data");
                recordSyncFailure();
            }
        } else {
            // Reception complete but decode failed
            if (es100UsingTracking) {
                // Tracking decode failed — poor signal conditions make normal mode (~134 s)
                // equally unlikely to succeed. Retry tracking on the next scheduled sync.
                // startWWVBSync() will fall back to normal mode after ES100_TRACKING_FALLBACK_MS.
                Serial.println("Tracking mode failed, will retry tracking on next scheduled sync");
                es100Receiving = false;
                es100UsingTracking = false;
                es100.stopReception();
                recordSyncFailure(true);
                return;
            }
            Serial.println("RX_OK not set despite RX_COMPLETE");
            recordSyncFailure();
        }

        es100Receiving = false;
        es100UsingTracking = false;
        es100.stopReception();

    } else if (irqStatus & ES100_IRQ_CYCLE_COMPLETE) {
        Serial.println("Reception cycle failed, ES100 retrying...");
    }
}

// ============================================================================
// Setup
// ============================================================================
void setup() {
    Serial.begin(115200);
    delay(2000);

    // Force serial output to flush
    Serial.flush();

    Serial.println("\n\n\n========================================");
    Serial.println("  WWVB Atomic Clock - ESP32-S3");
    Serial.println("  ES100 WWVB Receiver");
    Serial.println("  Display: LilyGo-AMOLED-Series");
    Serial.println("========================================");
    Serial.printf("Boot time: %lu ms\n", millis());
    Serial.println("========================================\n");

    // Configure task watchdog timer — auto-resets on I2C lockup or infinite loop
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_task_wdt_config_t wdtConfig = {
        .timeout_ms = 15000,
        .idle_core_mask = 0,
        .trigger_panic = true,
    };
    esp_task_wdt_reconfigure(&wdtConfig);
#else
    esp_task_wdt_init(15, true);
#endif
    esp_task_wdt_add(NULL);
    Serial.println("[WDT] Watchdog configured: 15s timeout");

    Serial.println("[BOOT] Starting initialization...");
    Serial.printf("[BOOT] Free heap: %d bytes\n", ESP.getFreeHeap());
    Serial.printf("[BOOT] PSRAM: %s\n", psramFound() ? "Found" : "Not found");

    // Initialize I2C bus 0 (touch, PMU, DS3231) - 400kHz fast mode
    Serial.println("[BOOT] Initializing I2C...");
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
    Wire.setClock(400000);
    Serial.println("[BOOT] Wire initialized (400kHz) - touch, PMU, DS3231 on GPIO 2/3");

    // Initialize I2C bus 1 (ES100 isolated) - 100kHz standard mode
    Wire1.begin(ES100_SDA_PIN, ES100_SCL_PIN);
    Wire1.setClock(100000);
    Serial.println("[BOOT] Wire1 initialized (100kHz) - ES100 on GPIO 15/16 (isolated)");

    // I2C bus scan on both buses
    // Note: ES100 (0x32) will NOT appear here — it only responds when EN is HIGH,
    // and EN is not driven until initializeES100() is called later in the main loop.
    Serial.println("[BOOT] Scanning Wire for devices...");
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire.beginTransmission(addr);
        if (Wire.endTransmission() == 0) {
            Serial.printf("[BOOT] Wire found device at 0x%02X\n", addr);
        }
    }
    Serial.println("[BOOT] Scanning Wire1 for devices...");
    for (uint8_t addr = 1; addr < 127; addr++) {
        Wire1.beginTransmission(addr);
        if (Wire1.endTransmission() == 0) {
            Serial.printf("[BOOT] Wire1 found device at 0x%02X\n", addr);
        }
    }
    Serial.println("[BOOT] I2C scan complete");

    // Initialize DS3231 RTC
    Serial.println("[BOOT] Initializing DS3231 RTC...");
    initializeDS3231();
    readDS3231Temperature();  // Get initial temperature reading

    // Initialize display (amoled.begin() re-initializes Wire internally for touch/PMU)
    Serial.println("[BOOT] Initializing display...");
    initDisplay();
    Serial.println("[BOOT] Display initialization complete");
    Serial.flush();  // Ensure all display messages are sent

    // Re-apply Wire clock after amoled.begin() which may reset it
    Wire.setClock(400000);
    Serial.println("[BOOT] Wire clock re-applied (400kHz)");

    // Show startup message
    Serial.println("[BOOT] Drawing startup message...");
    sprite.fillSprite(TFT_BLACK);

    // Explicitly set font to built-in Font 4
    sprite.setFreeFont(NULL);  // Use built-in fonts
    sprite.setTextFont(4);     // Font 4 is a good size

    sprite.setTextColor(TFT_CYAN, TFT_BLACK);
    sprite.setTextDatum(MC_DATUM);
    sprite.drawString("WWVB Clock", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2 - 20);
    sprite.drawString("Starting...", DISPLAY_WIDTH/2, DISPLAY_HEIGHT/2 + 20);
    Serial.println("[BOOT] Pushing startup message to display...");
    amoled.pushColors(0, 0, DISPLAY_WIDTH, DISPLAY_HEIGHT, (uint16_t*)sprite.getPointer());
    Serial.println("[BOOT] Startup message displayed");
    delay(2000);
    
    // Initialize ES100 with retry tracking
    lastES100InitAttempt = millis();

